// let txt1 = `附件3
// 泸州市商业银行
// 贷后管理报告
// （法人客户）
// （2020年一季度）


// 现场检查时间：2020年2月17日（本年第1次现场检查）
// 客户名称：四川中成煤炭建设（集团）有限责任公司
// 填报机构：成分业务五部
// 贷后主客户经理：陈峻平
// 贷后从客户经理：黄非
// 联系电话：17723323122
// 机构负责人：张谦
// 联系电话：18628102625







// 一、借款人基本信息
// （一）借款人目前基本情况
// 借款人四川中成煤炭建设(集团)有限责任公司于1998年5月13日注册，注册资本人民币10060万元，注册地址：成都市青羊区青华路39号，所属行业为建筑施工，2019年6月27日法定代表人正式由原董伦辉变更为柯军，公司主营业务范围：承包与其实力、规模、业绩相适应的国外工程项目。对外派遣实施上述境外工程所需的劳务人员；普通货运。矿山工程、房屋建筑工程、市政公用工程、公路工程、水利水电工程、地基与基础工程、遂道工程、桥梁工程、土方石工程、建筑装修装饰工程、公路路基工程、河湖整治工程、建筑防水工程、防腐保温工程、消防设施工程、金属门窗工程、公路路面工程；地质灾害治理工程监理；进出口业；工程项目管理；装卸搬运。
// 中成建设集团，创始于1992年，于1998年正式成立。中成建设  集团是四川省煤田地质局直属的大型国有施工企业，中成建设集团被中国建筑协会授予“2013年度全国工程建设质量管理优秀企业称号”。中成建设集团自成立以来，积极参与“市政公用工程”建设，跻身于交通、隧道、桥梁、水利等施工领域，并取得了辉煌的成就。在川、渝、陕、晋、皖、内蒙、赣、粤、藏、滇、黔等二十余个省、市、自治区以及成都、重庆、宜宾等大中型城市，承建了许多大中型项目。
// 在工业与民用建筑方面，先后建成了重庆银都公寓、重庆边检大厦、泸州市公安局应急指挥中心大楼、恒基电梯公寓、成都棕北小区、成都近郊金牛农民新居、中铁二局九里欣园及都江堰假日青城别墅、四川省人民政府办公厅地下停车场、四川大学双流校区学生宿舍二组团及教工住宅、西南财经大学绵阳校区第二教学楼及温江校区学生宿舍第二组团、四川师范大学化学楼、锦江区图书馆、四川省政府小礼堂等装饰装修工程。中成建设集团，位于“四川省建筑业先进企业名单”第67位。
//    申请人的实际控制人为四川省煤田地质局。借款人股东11家，股东结构表如下（股权占比1%以上的没有发生变化）： 
//                借款人  原股东构成
// 序号	股东名称	出资额（万元）	股权占比
// 1	四川省煤田地质局	7019.51	69.77%
// 2	成都天辰楼宾馆	1000	9.94%
// 3	四川省煤田地质局一三七队	667.84	6.64%
// 4	四川省煤田地质局一三五队	502.07	4.99%
// 5	四川省煤田地质局一四一队	499.76	4.97%
// 6	四川省煤田地质局地质测量队	141.52	1.41%
// 7	四川芙蓉集团实业有限责任公司	70	0.7%
// 8	成都环境工程建设有限公司	60	0.6%
// 9	四川煤炭综合服务公司	50	0.5%
// 10	成都市煤炭建筑公司	40	0.4%
// 11	重庆中环建设有限公司	9.3	0.09%
// 合计	10060	100%

// （二）借款人在我行贷款基本情况：
// 序号	业务品种	贷款金额	贷款资金使用情况是否正常	当前贷款余额	担保方式	贷款期限	五级分类形态
// 1	流动资金贷款	15000万	正常	15000万	保证担保	1年	正常
// 合计		15000万		15000万			
// 其中9000万期限为2019年4月29日至2020年4月29日，其中6000万期限为2019年5月6日至2020年4月29日。
// 二、生产经营情况
// 中成建设集团业务区域分布
// 中成建设集团 各地分公司/办事处
// 序号	地域	简介
// 1	北京分公司	北京办事处位于北京市海淀区，现有员工60人，其中专业技术人员20人，主要从事高端经营及全国范围内集团资质许可的工程建设
// 2	云南分公司	云南分公司位于昆明市，现有员工300余人，其中各类专业人员150余人，各类配套施工机械及仪器设备220余台套。
// 3	广西分公司	广西分公司位于南宁市，公司软、硬件设备齐备，拥有各类工程技术人员及员工150余人，拥有各类机械设备170台套。
// 4	陕西分公司	陕西分公司位于西安市，现有员工200余人，其中各类专业人员150余名，各类设备100余台套。主要从事各类工业及民用建筑、市政公用、道路桥梁，金属结构安装。
// 5	广东分公司	广东分公司位于清远市，办公面积500平米，现有业务人员5名，技术人员十余人，高级工程师、专业财务人员各一名。
// 6	第六分公司(水利水电)	第六分公司位于成都市，现有职工200余人，其中专业技术人员80余人，拥有大型设备20余台，中小型设备100余台。
// 7	山西分公司	山西分公司位于太原市，现有员工400余名，其中各类专业技术人员100余名，各类设备90余台。
// 8	贵州分公司	贵州分公司位于贵阳市，现有员工20余名，各类设备10余台。
// 9	内蒙古锡林郭勒盟分公司	内蒙古锡林郭勒盟分公司地处锡林浩特市，现有各类工程机械200余套，各方面工程管理人员50余人。
// 10	其他分公司：泸州分公司、德阳分公司、达州分公司等	　
// 11	驻外办事处：重庆办事处、新疆办事处	重庆办事处从事集团公司资质范围内在重庆建筑市场的经营、施工管理。新疆办事处位于乌鲁木齐市，现有员工120余名，拥有各类大中型机械设备70余套。

// 近两年在执行合同情况：
//                 　　　　  2018年中标合同登记表                 单位：万元
// 编号	项目名称	业主名称	合同金额  
// 1	永胜县程海镇半海子村泥石流治理等4个地灾监理工程	永胜县国土资源局	10.6
// 2	中粮珑悦锦云项目幼儿园精装修工程	成都鹏鼎置业有限责任公司	293.949456
// 3	高新区南部园区大源组团花荫村十二组商业、办公及附属设施项目（兴洲天府三街项目）土石方、基坑支护及降排水工程	成都兴洲数字电视传播有限公司	1399.8095
// 4	中粮御嶺湾会所507、517、553栋库存房品质提升工程	成都天泉置业有限责任公司	36.970187
// 5	祥云里项目桥梁工程	成都怡悦置业有限责任公司	68.282583
// 6	中粮办公室项目精装修工程	成都怡悦置业有限公司、成都鸿悦置业有限公司、成都兴洲数字电视传播有限公司、成都中金澎茂置业有限公司	147.187435
// 7	翠屏区中心城区“城市双修”项目投资建设合作合同	宜宾市翠屏区国有资产经营管理有限责任公司	25000
// 8	寿安污水管网整治工程	成都城西城市投资经营中心	1060.03
// 9	蓬安县锦屏新区干道改造工程项目城市地下综合管廊建设项目	蓬安县吉兴矿业开发有限责任公司	27479.56
// 10	2018-2019年剥离工程（三标段）	内蒙古平西白音华煤业有限公司	36907
// 11	锡林郭勒盟乌兰图嘎煤炭有限责任公司锗煤露天矿原煤破碎筛分工程及补充合同	锡林郭勒盟乌兰图嘎煤炭有限责任公司	单价包干3.91/T
// 12	白草尾矿库排洪系统改造升级工程	会理县财通铁钛有限责任公司	700
// 13	天府新区青龙苑区商品房项目-施工总承包EPC	四川煤田恒鑫房地产开发有限公司	59159.95991
// 14	平昌县西兴镇、龙岗镇、土垭乡、佛楼镇、高峰乡城乡建设用地增减挂钩项目建设工程	四川煤田美丽乡村土地整理有限公司	48000
// 15	攀钢集团攀枝花新白马矿业有限责任公司田家村采场采剥工程2018年合同及补充协议1、非煤矿山安全生产管理协议（2018.1.1-2018.12.31）、治安保卫协议、廉洁协议	攀钢集团攀枝花新白马矿业有限责任公司	单价包干
// 16	双流区永安镇梨园村农民集中建房项目I标段	成都双流梨花湾土地股份合作社	2229.9
// 17	中粮宸悦华庭项目土方分包工程	中建三局集团有限公司	73.832898
// 18	山西省采煤沦陷区综合治理大同煤矿集团雁崖煤业有限公司地质环境治理项目施工监理	大同市国土资源局云冈分局	9.1
// 19	泸县公共医疗卫生PPP项目框架协议、合同协议书	泸县人民政府、泸县卫生和计划教育局	109981.6
// 20	乔庄镇及贫困村安全饮水项目	青川县洁康水务投资有限公司	667.88
// 21	龙涧书苑房地产开发项目勘察设计施工总承包	泸州鼎诺房地产开发有限责任公司	建安下浮8%
// 22	东湖山生态修复（环湖彩林改造一期）（疏林草地改造一期）（东门入口生态环境改造）监理服务项目	德阳市公园管理处	2.015415
// 23	中粮地产祥云里项目样板房装修工程	成都怡悦置业有限公司	15.350203
// 24	山西潞安环保能源开发股份有限公司五阳煤矿地质环境治理项目监理（二标段）	襄垣县国土资源局	24.8
// 25	万寿苑（清水苑）商品住宅楼项目总平整改及围墙改建工程	四川省蜀府房屋建设开发有限公司	147.8706
// 	合计		343415.7

// 截止到2020年2月施工合同进度表（含以往未执行完毕的合同） 金额：万元
// 截至2019年12月31日中成集团在履约及尚未履约的主要工程项目
// 序号	主要项目名称	业主	合同总额	工期	累计已完成施工产值	工程进度
// 1	保利心语南侧中学工程	成都高投建设开发有限公司	14,340.04	540	12332.43	86.00%
// 2	攀钢集团攀枝花新白马矿业有限责任公司田家村采场采剥工程项目2014	攀钢集团攀枝花新白马矿业有限责任公司	5,920.00		5624.00	95.00%
// 3	忠县半城新区西流村拆迁安置及安居房项目（一标段）	重庆忠文化投资发展有限公司	8,501.16	730	7991.09	94.00%
// 4	山西离柳焦煤集团有限公司宏岩煤矿二期井巷工程	山西离柳焦煤集团有限公司	3,374.85	210	3206.11	95.00%
// 5	清远市清新区市政设施维护服务资格采购项目	清远市清新区城市综合管理局	4.5%下浮	1+2年	3118.07	80.00%
// 6	344国道石家映至千阳公路改建工程	陕西省宝鸡公路管理局	4,246.88	270	3907.13	92.00%
// 7	西北工业大学友谊小区北村住宅改造（二期）	西北工业大学	18,595.76	960天	15806.39	85.00%
// 8	国家物资储备西部核心物流基地项目施工II标段	陕西储备物资管理局五三三处	14,528.18	480	12494.24	86.00%
// 9	绵阳党史档案组团二标段	绵阳富达资产经营有限责任公司	9,001.81		8731.76	97.00%
// 10	绵阳市游仙区科学城快速通道（PPP模式）（主合同及与中联惠合同）	绵阳市游仙区政府	49,500.00	建设期2年	47025.00	95.00%
// 11	威远县2014年棚户区改造项目B区配套工程及补充协议	威远投资控股集团有限责任公司	2,616.05	720	2459.09	94.00%
// 12	巴中经济开发区西片区道路建设项目（10路、11路、22路）标段施工	四川巴中新城建设投资有限公司	1,390.77	150	1251.69	90.00%
// 13	金堂大道三星至高板段建设工程（K20+500-K22+400\K23+100-K24+330,六标段）	成都宜居水城城乡交通建设投资有限公司	5,858.34		4686.67	80.00%
// 14	成都轨道交通18号线工程土建1标降水井机械设备作业工程分包合同	中国水利水电第七工程局成都水电建设工程有限公司	175.96		149.57	85.00%
// 15	成都轨道交通18号线工程土建1标围护桩机械设备作业工程分包合同	中国水利水电第七工程局成都水电建设工程有限公司	1,439.22		1079.41	75.00%
// 16	大藤峡船闸及南木江副坝基础处理工程分包合同	中国葛洲坝集团第一工程有限公司大藤峡船闸及副坝工程施工项目部	2,092.49	36个月	1987.87	95.00%
// 17	天府二街（大源中央公园段）人行天桥	成都高投建设开发有限公司	2,751.63	180	2614.05	95.00%
// 18	重庆大学成树人小学及幼儿园主体工程桩基础增量工程补充施工合同	沙坪坝区教育委员会	6,059.43		5453.49	90.00%
// 19	S309线乐自高速贡井区连接线段新建工程PPP项目	贡井区交通运输局	40,782.18		35072.67	86.00%
// 20	塞纳国际四期9号楼工程	宜宾德通房地产开发有限公司	2,725.89	730	2589.60	95.00%
// 21	彭州丽春镇航空动力产业功能区新居工程勘察、设计、施工一体化总承包合同	彭州工业投资发展有限责任公司	11,389.49		7972.65	70.00%
// 22	塞纳国际四期4号楼及地下室工程	宜宾德通房地产开发有限公司	7,818.41	730	7427.49	95.00%
// 23	宜宾县金沙江左岸四期防洪护岸综合整治工程PPP项目	宜宾县水务局	44,631.98	建设期3年	11604.31	26.00%
// 24	“塞纳国际”商住小区五期建设项目	宜宾德通房地产开发有限公司	13,489.24		12814.78	95.00%
// 25	安岳县农村公路项目（一期）PPP	安岳县交通运输局	28,583.92	建设期2年	10861.89	38.00%
// 26	元宝山露天煤矿2017年生产采选工程一标段续签合同	内蒙古平庄煤业（集团）有限责任公司元宝山露天煤矿	按实结算		11357.89	
// 27	山西离柳焦煤集团有限公司宏岩煤矿三期井巷工程	山西离柳焦煤集团有限公司	5,068.43		4815.01	95.00%
// 28	永胜县程海镇半海子村泥石流治理等4个地灾监理工程	永胜县国土资源局	10.60		10.07	95.00%
// 29	中粮珑悦锦云项目幼儿园精装修工程	成都鹏鼎置业有限责任公司	293.95		205.76	70.00%
// 30	高新区南部园区大源组团花荫村十二组商业、办公及附属设施项目（兴洲天府三街项目）土石方、基坑支护及降排水工程	成都兴洲数字电视传播有限公司	1,399.81		979.87	70.00%
// 31	白草尾矿库排洪系统改造升级工程	会理县财通铁钛有限责任公司	700.00		560.00	80.00%
// 32	翠屏区中心城区“城市双修”项目投资建设合作合同	宜宾市翠屏区国有资产经营管理有限责任公司	25,000.00		23750.00	95.00%
// 33	寿安污水管网整治工程	成都城西城市投资经营中心	1,060.03		901.03	85.00%
// 34	蓬安县锦屏新区干道改造工程项目城市地下综合管廊建设项目	蓬安县吉兴矿业开发有限责任公司	27,479.56		16487.74	60.00%
// 35	2018-2019年剥离工程（三标段）	内蒙古平西白音华煤业有限公司	36,907.00		35061.65	95.00%
// 36	金牛区成华南街等26项排水管网病害整治非开挖技术修复治理服务项目	成都市金牛区统筹城乡和水务局	2128.42		2022.00	95.00%
// 37	峨胜采矿场1200万吨/年扩大开采范围技改工程石灰石破碎及运输系统项目	四川峨胜水泥集团股份有限公司	据实核算		2956.20	
// 38	成都市排水设施管理处成华南路街12条排水管网病害治理维护工程项目	成都市排水设施管理处	459.14		436.18	95.00%
// 39	古蔺县重点扶贫农村公路顺秋亭至桂花、头道河至双沙改建工程	古蔺县蔺州干线公路建设有限公司	24659.23		2465.92	10%
// 40	成都市四环内排水管网普查预处理作业项目2标段	成都兴蓉市政设施管理有限公司	5670		0.00	0.00%
// 41	泸县公共医疗卫生PPP项目	泸州市龙城中汇建设有限公司	44714.27	2年	13414.28	30.00%
// 合计			475364.14		343685.05	

// 以上工程情况表为借款人能提供的最详尽的表格数据，除PPP项目以外，上表中“翠屏区中心城区“城市双修”项目投资建设合作合同”、“蓬安县锦屏新区干道改造工程项目城市地下综合管廊建设项目”、“天府新区青龙苑区商品房项目-施工总承包EPC”、“天府二街（大源中央公园段）人行天桥”为EPC项目,其它为一般性施工工程。由于上次贷后接近年末，加上近期疫情原因，借款人近期工程新增数量极少；另外此次工程进度表中工程最新进度对比上次贷后变化不大，也和借款人近期疫情原因导致借款人内部工程进度统计的时间差有关。
// 我部将着重关注从本年度三月起借款人的新增工程情况，着重关注借款人的经营发展情况。
// 本次贷后，我部仍只取得借款人2019年三季度的经营资料。借款人部分分公司、项目公司结算和纳税是属地化，公司本部主要结算行为建行一支行和建行岷江支行，故借款人报表显示2018年全年收入23.19亿，纳税额为11.18亿为本部纳税收入；2019年借款人1-9月报表反应收入为17.56亿元，纳税额为8.6亿元。另外，借款人增值税申报表上的收入要跟开具的发票直接相符，而会计上确认收入借款人按照权责发生制，造成会计报表收入与税务申报收入的不同，因此未在纳税申报表收入上体现。截至目前，部分工程，例如绵阳、自贡、宜宾PPP项目工程部分收入均未开具发票，其他施工工程，亦存在这种现象。（建筑企业普遍存在这种现象，按完成节点确认收入，但只在最后一次性开具发票，目的：1：延缓交税；2：方便与甲方业主单位确认最终开票金额）。截止2020年2月，未执行完合同主要为投融建和PPP模式的大型房、基础设施等项目，其中比较典型的PPP项目情况如下：
// 绵阳市游仙区科学城快速通道，项目总投资69500万，SPV公司为四川中联惠建设工程有限公司为我行授信客户，授信金额60000万，目前已投放55000万，截止目前，贷款余额48958万元。　　
// 宜宾县宜宾县金沙江左岸四期防洪护岸综合整治工程PPP项目，项目总投中施工合同金额44631.98万元，SPV公司为四川德泽君建设有限公司，成立于2017年9月13日，注册资金5000万，由借款人与宜宾县城市建设投资开发有限责任公司组建，该项目目前处于实施阶段，目前借款人正与宜宾金江农商行对接项目融资事宜，项目贷款已下批复，批复贷款金额45500万元，已于2019年9月11日已经签订合同并提款3000万元，期限为2019年9月11日至2032年8月25日；于2019年11月22日提款1000万元，期限为2019年11月22日至2032年8月25日；于2019年12月27日提款800万元，期限为2019年12月27日至2032年8月25日。
// 自贡市的S309线乐自高速贡井区连接线段新建工程PPP项目，项目总投中施工合同金额为40782.18万元，SPV公司为自贡成鑫交通建设工程有限公司，成立于2017年7月11日，注册资金5000万，由借款人与自贡路鑫交通建设工程有限公司组建，该项目目前处于执行阶段，项目资本金已投入14506.57万，中成已投入13781.24万，农业银行荣县支行已授信5.8亿，并于2018年7月14日投放了500万，期限为2018年7月14日至2019年12月25日；于2018年7月31日投入了4500万元，期限2018年7月31日至2026年12月23日；于2018年8月1日投放了20000万元，期限2018年8月1日至2024年12月25日；于2018年10月1日投放了10000万元，期限2018年10月1日至2029年12月25日；于2019年1月1日投放了15000万元，期限2019年1月1日至2030年12月24日，截止目前，合计已发放贷款金额5亿。
// 四川省安岳县农村公路项目（一期）PPP合同，项目总投中施工合同金额为28583.92万元，SPV公司为四川中惠岳建设工程有限责任公司，成立于2017年12月22日，注册资金1000万，由借款人与安岳县交通投资开发有限责任公司组建，该项目目前处于实施阶段，进度情况见上表。目前借款人与安岳农发行已经于2020年1月中旬签订了借款合同，项目贷款合同金额2.4亿，将于近期复工后提款。
// 泸州市龙城中汇建设有限公司，注册资金5000万，2018年12月7日成立，法定代表人纪号彪，中成建设集团持该公司38.94%股权。泸州市龙城中汇建设有限公司为执行泸县公共医疗卫生PPP项目而成立，注册地址为四川省泸州市泸县玉蟾街道建设社区泸泉路13-2-600附201-205号。该项目目前处于实施阶段，截止本报告日资本金投入已超过10500万，农发行泸县支行8.79亿贷款已2019年6月19日下发批复，贷款年限15年，并于2019年9月24日签订了借款合同，利率为LPR报价五年档次加103个基点，并于2019年11月1日投放了4282.03万元，期限为2019年11月1日至2034年10月31日；于2020年1月16日投放了6498.25万元，期限为2019年11月1日至2034年10月31日。
// 本季度贷后环比上季度贷后，借款人工程主要增加了“古蔺县重点扶贫农村公路顺秋亭至桂花、头道河至双沙改建工程”施工项目，以及泸县公共医疗卫生PPP项目的施工启动。“古蔺县重点扶贫农村公路顺秋亭至桂花、头道河至双沙改建工程”施工项目工程合同总额24659.23万，该项目为政府专项资金，模式为常规施工模式。
// 2017年以来，借款人所承接工程绝大多数都为中长期项目，主要为PPP项目和EPC项目，占用资金量较大，承接的工程大多数都是两至三年的建设期，为求按时保质保量完成2015年所承接工程项目，2017年以来，借款人适度择优承接新项目，目前PPP项目和投融建项目执行情况较为良好。但经本次贷后调查与企业管理层沟通，借款人本年度中旬后，因外部及内部审查，经营放缓，加上近期疫情原因，新增合同量很少，目前主要保证所期所承接的项目的正常完工。另外，据本次借款人高层介绍，借款人今后的经营策略将不再接手PPP项目类，经营发展方向将重点发展常规性且风险系数评判较低的小型工程施工项目，避免大量流动资金积压，分散经营风险。此情况我部将跟踪调查，严密关注借款经营发展情况的变化。

// 三、财务状况分析
// （一）基本财务信息分析
// 由于借款人为大型国有企业，不出具月报，出具季报，截止贷后报告日，借款人2019年第三季度报表及2018年年末报表数据如下：

// 资产负债表
// 项目	2018年期末	2019年9月	项目	2018年期末	2019年9月
// 货币资金	4709.18	16567.38	银行借款	49000	43200
// 短期投资	0	0	应付票据	0	22916.12
// 应收票据	6517.00	46666.56	应付账款	29358.61	
// 应收账款	52301.87		预收账款	26642.94	32957.35
// 应收股利	0	0	应付工资	95.21	6.59
// 其他应收款	45159.16	42391.79	应付福利费	0	0
// 预付账款	3488.49	5375.33	应付利润	0	0
// 期货保证金	0	0	应付利息	0	0
// 应收补贴款	0	0	应交税费	-1586.75	-2505.47
// 应收出口退税	0	0	其他应交款	0	0
// 存货	37975.73	41564.73	其他应付款	26547.86	22854.17
// 待摊费用	0	0	预提费用	0	0
// 待处理流动资产净损失	0	0	预计负债	0	0
// 一年内到期的长期债权投资	0	0	递延收益	0	0
// 其他流动资产	16.74	16.74	一年内到期的长期负债	0	0
// 流动资产合计	150168.18	152582.54	其他流动负债	0	0
// 长期投资	18328.89	20975.89	流动负债合计	130057.87	119428.75
// 其中：长期股权投资	18328.89	20975.89	长期借款	0	0
// 长期债权投资	0	0	应会债券	0	0
// 长期应收款	89157.94	82776.81	长期应付款	8665.06	12424.91
// 固定资产原价	21216.64	22989.11	专项应付款	0	0
// 减：累计折旧	11581.37	12223.72	其他长期负债	0	0
// 固定资产净值	9635.26	10765.38	长期负债合计	8665.06	12424.91
// 减：固定资产减值准备	0	0	负债合计	138722.93	131853.66
// 固定资产净额	9635.26	10765.38	少数股东权益	0	0
// 在建工程	0	0	实收资本	10060	10060
// 无形资产	0	7.35	其中：国家资本	0	0
// 递延资产	0	0	　　　集体资本	0	0
// 递延税款借项	0	0	　　　法人资本	10060	10060
// 资产总额	267290.27	267107.98	　　　个人资本	0	0
// 			　　　外商资本	0	0
// 			资本公积	12.02	12.02
// 			盈余公积	26434.14	26434.14
// 			未分配利润	92061.19	98748.17
// 			外币报表折算差额	0	0
// 			所有者权益合计	128567.35	135254.32
// 			负债和所有者权益合计	267290.27	267107.98
// 利润表
// 	2018年期末	2019年9月			
// 一、主营业务收入	231915.33	175646.84			
// 二、营业总成本	212278.66	167064.52			
// 其中：减：主营业务成本	197283.37	161729.5			
// 减：主营业务税金及附加	7391.49	696.46			
// 减：经营费用	0	0			
// 减：其它	0	0			
// 加：递延收益	0	0			
// 加：代购代销收入	0	0			
// 加：其他	0	0			
// 加：其它业务利润	34.84	14.54			
// 减：营业费用	0	0			
// 减：管理费用	3524.98	2686.23			
// 减：财务费用	4078.81	1952.34			
// 减：其他	0	0			
// 四、营业利润	19671.52	8596.86			
// 加：（一）投资收益	0	0			
// 　 （二）期货收益	0	0			
// （三）补贴收入	0	0			
// （四）营业外收入	7.53	10.00			
// 　 （五）其他	0	0			
// 减：（一）营业外支出	16.77	4.21			
// （二）其他支出	0	0			
// 五、利润总额	19662.28	8602.64			
// 减：所得税	4915.57	1915.67			
// 六、净利润	14746.71	6686.98			

// 因2019年9月末报表无现金流量表，暂无附注，本月贷后只特别调查了报表中变化较大的科目，其余科目以2018年末数据作分析。
// 货币资金(万元)
// 	2016年	2017年	2018年	2019年9月
// 货币资金 	5450.92	5619.3	4709.18	16567.38
// 货币资金主要是银行存款及库存现金,其中银行存款为16567.38万元，无受限资金，2019年多个大型项目的施工收入集中回款，造成时点存款增多。
// 应收账款及应收票据(万元)
// 	2016年	2017年	2018年	2019年9月
// 应收账款	38744.92	52165.39	52301.87	46666.56
// 中成建设集团为国有企业，发展相对稳健。对承接的工程选择较为严格，垫资较大的工程一般不接，尽量减少发包方对公司资金的占用。煤田地质局对下属单位财务管理较为严格，特别是工程回款，要求严格按照合同约定、进度执行，每个项目均安排了专人负责催收工程款。随着公司承接工程量的增加，应收账款余额增涨较快。中成建设集团为国有企业，发展相对稳健。对承接的工程选择较为严格，垫资较大的工程一般不接，尽量减少发包方对公司资金的占用。煤田地质局对下属单位财务管理较为严格，特别是工程回款，要求严格按照合同约定、进度执行，每个项目均安排了专人负责催收工程款。所以，较一般国有建筑类企业而言，中成建设集团工程款回收效果较好。

// 预付账款(万元)
// 	2016年	2017年	2018年	2019年9月
// 预付账款	0	0	3488.49	5375.33
// 2018年之前借款人账务处理，预付款项做账为应收款项类，2018年后账务调整后预付款项体现出来，主要为机械设备和原材料的预付款项。2019年9月较2018年末预付款项增加近2000万元，主要是借款人2018年至2019年PPP大型施工项目的增加，在实施过程中材料款项的增加和设备使用款项的预付款。
// 其他应收款(万元)
// 	2016年	2017年	2018年	2019年9月
// 其他应收款	47183.12	50836.31	45159.16	42391.79
// 主要为内部往来款及履约保证金，2019年9月暂无科目明细，故列明2018年年末主要债务人明细。2019年9月末较2018年末变化不大。
// 2018年末前十大其他应收款明细
// 名称	金额	款项性质
// 绵阳惠东投资控股有限责任公司
// 	5000.00	其他
// 四川中成煤田投资有限责任公司	4563.32	内部往来
// 内蒙古鑫昊建设工程有限公司	2813.00	往来
// 锡林郭勒盟鑫昊工贸有限责任公司	2504.00	往来
// 彭州市丽春新居工程	2365.56	项目材料预付款
// 新白马田家村采场铲装运项目	2291.23	项目材料预付款
// 内蒙古煤建设工程有限公司	2000.00	履约保证金
// 成都中冶田园世界置业有限公司	1500.00	履约保证金
// 成都市五大花园地区基础设施建设投资有限公司
// 	1260.62	履约保证金
// 天辰楼
// 	1000.00	内部往来
// 合计

// 	25297.74
	
// 其他应收款资金主要为项目质保金、投标保证金、履约保证金、备用金等以及关联公司的一些往来款项，其中项目材料预付款为垫付资金。除以上前十大其他应收款外，其他应收款较为零散，多达上百项，账龄在一年以内的占74.96，未有坏账准备。
// 存货(万元)

// 存货	2016年	2017年	2018年	2019年9月
// 原材料	9892.64	9391.62	7528.31	41564.73
// 未结转工程成本	33230.74	36824.91	30447.42	
// 合计	43123.38	46216.53	37975.73	41564.73
    
// 以上数据为存货账面价值，未作跌价准备，存货主要是原材料和未结转工程成本。借款人几大PPP项目和金额较大的常规项目的实施，原材料的库存相应有所增加。
// 长期应收款 (万元)
// 　	2016年	2017年	2018年	2019年9月
// 其他长期资产	63871	77412.24	89157.94	82776.81
// 2018年年末及2019年9月末其它长期资产主要单位如下：
// 客户名称	2018年末	2019年6月
// 四川省乐至县交通投资开发有限责任公司	1571.00	1571.00
// 四川省煤田地质局	3800.00	3800.00
// 四川中成煤田投资有限责任公司	44000.00	35000.00
// 四川中联惠建设工程有限公司	8010.00	8010.00
// 自贡成鑫交通建设工程有限公司	9031.24	9031.24
// 四川德泽君建设有限公司	6500.00	5777.17
// 四川煤田恒鑫房地产开发有限公司	7500.00	8400.00
// 四川中惠岳建设工程有限责任公司	3745.7	9045.7
// 四川煤田美丽乡村土地整理有限公司	5000.00	0
// 泸州市龙城中汇建设有限公司		2141.7
// 合计	89157.94	82776.81
// 据调查，2019年9月末科目调整，2019年9月较2018年末长期应收款减少6381.13万元，主要是四川中成煤田投资有限责任公司的往来款减少了9000万元，四川煤田恒鑫房地产开发有限公司增加了900万元，四川德泽君建设有限公司减少了733万元，四川中惠岳建设工程有限责任公司增加了5300万元，四川煤田美丽乡村土地整理有限公司减少了5000万元，另外增加了PPP项目公司泸州市龙城中汇建设有限公司2141.7万元资本金。
// 其他长期资产实质是长期应收款。其中数额较大的主要是关联公司四川中成煤田投资有限责任公司、四川中联惠建设工程有限公司、自贡成鑫交通建设工程有限公司、四川煤田恒鑫房地产开发有限公司（天府新区眉山直管区天府龙城房产项目公司）、四川德泽君建设有限公司的往来款。

// 长期股权投资 (万元)
// 　	2016年	2017年	2018年	2019年9月
// 长期股权投资	9420.7	16774.59	18328.89	20975.89
// 2018年年末及2019年9月末其它长期资产主要单位如下：
// 客户名称	2018年末	2019年9月
// 四川省泸州市一三五岩土工程有限公司	1094.19	1094.19
// 四川省煤田地质一三七总公司	1094.19	1094.19
// 四川省煤田地质局一四一开发总公司	556.21	556.21
// 四川华源矿业勘查开发有限责任公司	100.00	100.00
// 四川中联惠建设工程有限公司	4500.00	4500.00
// 自贡成鑫交通建设有限公司	4750.00	4750.00
// 四川煤田大地投资公司	180.00	180.00
// 四川德泽君建设有限公司	4500.00	4500.00
// 四川中惠岳建设工程有限责任公司	954.3	954.3
// 四川煤田美丽乡村土地整理有限公司	600.00	600.00
// 四川众城房地产开发有限公司		700.00
// 泸州市龙城中汇建设有限公司		1947.00
// 合计	18328.89	20975.89

// 另外，应付账款2019年初为29358.61万元，2019年9月末为22916.12万元，较年初减少6442.49万元，主要是借款人的小型常规项目新增减少，且历史合同部分进入回收期后，所欠工程材料款阶段性偿付导致；
// 预收账款2019年初为26642.94万元，2019年9月末为32957.35万元，较年增加6134.41万元，主要为绵阳PPP项目及其他若干小项目阶段性进入回收期，工程预收款增加；
// 其他应付款2019年初为26547.86万元，2019年9月末为22854.17万元，较年减少3693.69万元，主要是部分归还了关联公司借款。
// 长期应付款2019年初为8665.06万元，2019年9月末为12424.91万元，较年初增加了3759.85万元，主要是增加了成渝融资租赁有限公司和广州万宝融资租赁有限公司融资租赁款约4600万，以及部分归还了平安国际融资租赁有限公司的融资租赁款造成。
// 由于客户所处行业为建筑行业，建设项目经营周期一般较长，其指标变化不大，属于正常状态。
//     2016年12月的财务报表：资产总额219308.90万元，负债总额121070.28万元，短期借款53000.00万元，净资产98238.61万元，主营业务收入234208.34万元，利润总额17127.19万元。
// 2017年12月财务报表：资产总额263213.34万元，负债总额149392.7万元，短期借款60000万元，净资产113820.64万元，主营业务收入222995.51万元，利润总额19198.32万元。
// 2018年12月财务报表：资产总额267290.27万元，负债总额138722.93万元，短期借款49000万元，净资产128567.35万元，主营业务收入231915.33万元，利润总额19662.28万元。
// 2019年9月财务报表：资产总额254924.72万元，负债总额141915.02万元，短期借款61300万元，净资产133009.7万元，主营业务收入110929.03万元，利润总额5474.81万元。
// 由于借款人行业为工程施工，周期一般较长，故以全年的财务指标来看较为准确。2018年12月偿债指标中：资产负债率52%，流动比率115.46%，速动比率84%，大大优于该行业平均比率。营运指标：总资产周转率87%，流动资产周转率151%，应收账款周转率444%，存货周转率469%，处于行业较高值。盈利指标：销售增长率4%，销售利润率8.48%，总资产报酬率9%，净资产收益率12%，都略高于行业平均值。

// （二）对外融资和担保情况
// 1、对外融资情况
// 经2020年2月17日查询借款人征信，借款人贷款合计41545.12万元，比上季度贷后减少了3961.65万，详细授信情况如下：
// 我行贷款余额15000万元，其中9000万元期限为2019年4月29日至2020年4月29日；其中6000万元期限为2019年5月6日至2020年4月29日。
// 光大银行流动资金贷款10000万元，期限为2019年12月12日至2020年6月15日。
// 渤海银行流动资金贷款5000万，期限为2019年2月18日至2020年1月29日，据调查，本笔贷款已按时还款，征信显示错误。
// 重庆银行流动资金贷款3200万，期限为2019年3月25日至2021年3月24日，比上季度贷后减少100万。
// 平安国际融资租赁有限公司2105.12万元，其中605.12万期限为2018年06月29日至2021年06月29日；其中750万期限为2018年04月11日至2021年04月11日；其中750万期限为2018年03月30日至2021年03月30日。
// 浦发银行蜀汉路支行对借款人授信5000万元，其中2000万元是流动资金贷款，期限为2020年1月7日至2020年7月6日，另外是表外银承敞口3000万元，保证金750万元，开票金额3750万元，期限为2020年1月15日至2020年7月15日。
// 天府银行490万元，期限为2019年12月23日至2020年12月23日，是该银行的新流动资金产品，名称为政采贷，据借款人介绍该笔贷款为天府银行的政策性产品，单户最高使用额度为500万元，借款人因维护银行关系而申请的贷款。
// 借款人征信显示贷款余额合计为37795.12万元，银承票据3750万元，敞口3000万元，但据调查，截止2020年1月9日，借款人征信显示外的“长期应付款”科目里隐形的成渝融资租赁有限公司和广州万宝融资租赁有限公司的融资租赁款余额合计8529.25万元。其中成渝融资租赁有限公司余额为4606.8万元，到期日为2021年8月8日；广州万宝融资租赁有限公司余额为3922.45万元，到期日为2022年6月14日，详细期限因疫情原因暂无法核实。该两家融资租赁公司采用的方式为售后回租，授信均为5000万元。借款人无对外担保记录。

// 2、对外担保情况如下
// 借款人无对外担保记录。

// 四、客户资金账户监管
// 1、资金回行情况：
// 当季纳税情况调查
// 现金流量表中“销售商品、提供劳务收到的现金”科目余额	2018年12月报表反映该科目为251268.02万（季报无现金流量表）
// 税单/防伪税控开票子系统反映的纳税收入额	2019年9月纳税收入额为85973.24万元（2019年9月本部）
// 主要银行账户流水中反映的经营收入额（含我行经营流水）	2019年10月至12月年累计主要银行账户流水为27337.62 万元
// 我行资金回行情况
// 事项时段	月度	季度	年度	贷款发放日（2019年4月29日）至检查日
// 回行（剔除非经营性流入）	2019年10月74.81万
// 2019年11月223.05万
// 2019年12月1738.39万	2019年四季度2036.25万	2019年1月1日至2019年12月31日8758.49万	2019年4月29日至2020年2月26日19147.73万
// 日均	2019年10月553.14万
// 2019年11月482.82万
// 2019年12月464.28万	500.27万	458.2万	584.84万

// 2、根据我行与借款人所签订的编号为“沪商成分业务五部账监2019年第16号”《账户监管协议》第1.1条、第4.4条约定：“借款人必须保证监管账户资金的季流入量不低于当季第1.1条所述收入的10%”，从2019年4月29日和2019年5月6日分别发放了9000万和6000万贷款（回收再贷），之前与借款人沟通的按新签订的《账户监管协议》要求按比例进行资金回笼，目前此情况已得到改善，并承诺以后也将要求其严格按照《账户监管协议》约定在我行进行资金回笼。
// 3、监控客户账户未发生查封、冻结或扣划等严重影响我行信贷资金安全的事件。

// 五、贷款担保状况分析
// 客户使用信用，追加保证，追加保证人基本情况较保前无明显变化。保证人成立于2011年，成立时间相对较短。但保证人成立之初就被赋予了相对明确的职责，肩负着管理职能和服务职能，包括战略管理、资产管理、目标管理、投资决策等。中成投资公司董事长兼任四川省煤田地质局局长，中成投资公司在煤田地质局内占据重要的管理地位。煤田地质局自1953年成立以来，为四川省乃至西南地区的地质工作做出了巨大的贡献，特别是在煤矿等矿产资源方面具有得天独厚的优势。中成投资公司作为煤田地质局的投资项目管理者，其本身的管理能力、经营能力都是出类拔萃的。
//     2017年12月的财务报表（合并）：资产总额388352.01万元，净资产214292.33万元，主营业务收入297547.97万元，利润总额40865.07万元。
// 2018年12月报表（合并）：资产总额388554.71万元，净资产240933.72万元，主营业务收入304277.51万元，利润总额39343.16万元。
// 2018年12月偿债指标中：资产负债率37%，流动比率204.01%，速动比率137%，优于该行业平均指标。短期偿债能力较强。
// 2019年9月报表（合并）：资产总额385317.59万元，净资产248644.56万元，主营业务收入199561.48万元，利润总额9924.48万元。
// 截止2020年2月17日担保人对外保证担保余额为33200万元，全部为针对关联企业借款人四川中成煤炭建设（集团）有限责任公司的担保。担保对应的贷款如下：
// 我行贷款余额15000万元，其中9000万元期限为2019年4月29日至2020年4月29日；其中6000万元期限为2019年5月6日至2020年4月29日。
// 光大银行流动资金贷款10000万元，期限为2019年12月12日至2020年6月15日。
// 浦发银行蜀汉路支行对借款人授信5000万元，其中2000万元是流动资金贷款，期限为2020年1月7日至2020年7月6日，另外是表外银承敞口3000万元，保证金750万元，开票金额3750万元。
// 重庆银行流动资金贷款3200万，期限为2019年3月25日至2021年3月24日。
// 本次征信显示有误。
// 担保能力测算：
// 担保人2019年9月合并报表净资产248644.56万元－对外保证担保余额为33200万元＝215444.56万元。
// 本次贷款主要以信用为主，担保方式为追加担保人保证担保。
// 六、对内外部检查的整改、审批要求等贷后落实情况
// 审批贷后管理要求如下：
// 根据2019年4月28日泸州银行信贷业务审批书（编号：成都分行（2019）7号）贷后管理要求：
// （一）借款人及集团相关：密切关注其承建项目的建设情况，工程进度、施工安全等情况，全面掌握借款人工程款的回收进度；重点掌握借款人合同履约情况及新合同的签订情况；掌握借款人资产、负债、征信、对外担保、现金流等变化情况，并按季收集融资人的财务报告，分析其经营情况及财务情况；督促借款人严格履行《账户监管协议》，对大额资金走向进行分析，是否存在异常；密切关注借款人涉诉案件进展和变化情况，若出现大额涉诉或被执行案件，应及时采取风险防范措施；密切关注关联企业占用资金的情况和资金回收情况；关注借款人子公司、关联公司的PPP、投融建等项目的融资和实施情况，关注项目资本金到位情况、融资情况、政府付费情况；关注借款人集团公司的经营变化、盈利能力变化及他行对该客户的信贷政策变化等情况，如出现其他金融机构大额压缩贷款的情况，须及时风险预警并采取风险防范措施；关注新到位管理人员对公司的管理政策及管理人员变动情况。
// （二）担保人相关：加强与保证人的联系，掌握保证人资产、负债、信用信息、对外担保、现金流等变化情况，并按季收集保证人财务报告，分析其经营情况、财务情况及代偿情况，与担保人共同督促借款人还本付息。
// （三）外部环境相关：应密切关注建筑施工行业和PPP政策变化、市场变化对借款人的影响。

// 七、还款执行情况
// 根据信贷客户合同约定及规定的还款计划，借款人履约情况良好，按合同约定的计划还本付息。
// 归还时间	归还金额（万元）	是否按计划归还
// 2020年4月29日	15000	未到期
// 合计	15000	

// 八、其他情况
// 2020年2月18日通过中国裁判文书网、天眼查查询，借款人共687条法院判决信息，其中664条均为劳务纠纷与合同纠纷，我部逐条排查，均属并无重大影响企业经营的案件；另外有23条与民间借贷有关案件裁定，据核实，一部份是信息录入归类错误，实为施工合同经济纠纷，剩余部分实际非借款人发生的借贷关系，主要是项目公司的负责人个人借贷关系；另外有2条属第三方案件，与借款人无关。
// 通过全国被执行人网查询，借款人被执行人信息有3条：
// 1、立案时间2020年1月16日，案号：（2020）川1823执136号，执行法院：汉源县人民法院，执行标的：101200元。
// 2、立案时间2017年3月16日，案号：（2017）川0402执518号，执行法院：攀枝花市东区人民法院，执行标的：58300元，未履行金额58300元。
// 3、立案时间2017年7月4日，案号：（2017）黔0302执1875号，执行法院：遵义市红花岗区人民法院，执行标的：3105700元，未履行金额1931032元。
// 据调查，以上执行信息是借款人项目管理问题导致，涉案金额不大，此事借款人正在解决之中。
// 通过失信被执行人网查询：借款人无失信被执行人记录。查询2018年“关于转发失信被执行人名单信息的通知”中申请人及其股东、关联公司均未记录。
// 通过国家企业信用信息公示系统对借款人情况进行了核实，情况如下：（1）公示系统显示的信息与营业执照记载内容一致；（2）企业公示信息：无行政处罚、无知识产权出质登记信息。（3）工商行政管理部门公示的相关信息有登记信息、备案信息，无经营异常信息、无严重违法信息、无抽查信息。
// 通过查询主要关联公司四川中成煤田投资有限责任公司银行征信，2020年2月17日企业信用报告显示：
// 中成投资无借款记录，担保人对外保证担保余额为33200万元，全部为针对关联企业借款人四川中成煤炭建设（集团）有限责任公司的担保，信用良好。
// 2020年2月18日通过中国裁判文书网查询、天眼查查询，担保人共58条法院判决信息，其中担保人作为第三方的有5条，其余51条为担保人作为投资纠纷的原告，且案件诉讼期都较长，对目前来说，不会对企业经营产生重大影响。
// 2019年11月7日通过全国被执行人网查询和失信被执行人网查询，担保人有一条被执行人信息，立案时间2019年8月15日，案号：（2019）川01执2648号，执行法院：成都市中级人民法院，执行标的：25767497元。无失信被执行人信息。该案由是四川物流物资贸易有限公司与四川中成恒通贸易发展有限责任公司钢材贸易合同纠纷，四川物流物资贸易有限公司销售货款金额本金为30566844.77元的钢材给四川中成恒通贸易发展有限责任公司，并由四川中成煤田投资有限责任公司承担连带清偿责任，四川中成恒通贸易发展有限责任公司未支付货款给四川物流物资贸易有限公司，四川物流物资贸易有限公司于2018年7月2日对四川中成恒通贸易发展有限责任公司及四川中成煤田投资有限责任公司提起诉讼，判定四川中成恒通贸易发展有限责任公司及四川中成煤田投资有限责任公司支付货款金额本金30566844.77元，支付截止自2016年6月30日的货款加价款13192564.36元，支付自2016年7月1日起至2018年6月30日止利息6333916.9元。截止2018年7月24日，尚欠货款本金25566844.77元，利息19526481.26元，合计45093326.03元。截止目前，被告方最终还尚上述执行金额25767497元。经调查了解，四川中成煤田投资有限责任公司确认案件事实与金额，并与四川物流物资贸易有限公司达成和解，将于近期偿还该款项。
// 借款人实际控制人四川省煤田地质局为成都市4大省直属局级事业单位，征信无法查询。

// 九、风险因素分析
// 1、政策风险：建筑企业在工程项目实施过程中，由于政府的强势地位容易导致项目运作过程中决策的随意变更，还有诸如政府换届导致的政策不连续等，会在项目实施的不同阶段给企业带来困扰。
// 2、经营风险：借款人目前经营发展放缓，跟前期外部和内部的审查有关，短期内公司经营发展受影响，新增业务减少。另外，借款人所投资的SPV公司四川中联惠建设工程有限公司所实施的绵阳市游仙区科学城快速通道PPP项目，该项目公司为我行授信客户，授信金额60000万，最终实现投放55000万，该项目贷款第一次按计划回收时间点为2019年3月31日，后经SPV公司及绵阳市游仙区政府提出申请，变更第一次还款计划时间点为2019年7月1日。但由于政府最终未按变更后的还款计划全额付费给SPV公司，上季度贷后调查中，政府实际付费金额为4000万元，剩余1917万元由借款人垫付，实质上绵阳市游仙区政府已经未按约定全额付费。本次调查中，政府已支付原合同约定的第一年期全额付费款项，合计8687万元。详细情况见四川中联惠建设工程有限公司2020年一季度贷后报告。借款人实施中的PPP施工项目共计五个，政府PPP项目是否能按约付费，直接会对借款人的资金流造成严重影响，最终将影响借款人在我行的流动资金贷款的偿还。
// 3、工程建设风险：工程项目管理粗放，精细化程度低下，人员质量、安全意识不强，管理能力不足，现场管理不到位以及员工道德因素等，都可能导致工程质量或安全出现问题，一旦出现问题，将使企业蒙受相应的经济、效益和信誉损失。
// 4、财务风险：企业筹资决策不当引发资本结构不合理或无效融资，使企业融资成本过高；投资决策失误、资金调度不合理、运营不畅等都可能导致企业陷入财务危机。
// 6、管理风险：2019年6月28日，借款人原董事长、总裁陈隆德因严重违法违幻，被甘孜州监委立案调查，相关信息已经公示。借款人随后对外说明，陈隆德违法属个人行为，且借款人高管为任命制，对借款人经营无重大影响。但该事件导致外部行政机构对整个四川省煤田地质局进行审查，导致目前借款人经营发展放缓，借款人目前新增业务很少，对未来的经营发展造成明显的影响。
// 7、其它风险：借款人行业为建设施工，经营过程中各种法律较多，本次贷后发现借款人裁判文书信息达687条之多，相比上次贷后又增加了54条，主要是合同纠纷案，在管理和运营发展过程中，有可能造成不可预计的经营风险和赔偿风险。据借款人管理层说明，借款人法律诉讼一直在上升的情况，多数为前期管理不善造成的法律相关问题而在逐步显现出来，目前正在积极解决和处理当中，后期在公司运营管理上将作全面化的改进，减少法律风险。

// 十、结论及工作措施建议
// 借款人为四川省煤田地质局直属大型国有施工企业，资产规模较大、行业排名靠前，经过二十多年的经营发展，已经成为行业中具有相当实力的企业。从当下及未来趋势，该企业都是众多金融机构争相合作的优质客户。该企业抗风险能力强，对于债权人来讲，具有较强的短期、长期负债还款能力，且深入合作潜力较大，同时做好以下工作：
// 1、目前该企业现行管理机制严密，技术经营体系健全，运行良好，有效地控制了管理风险。前期四川省煤田地质局因干部年轻化，借款人高层发生变化后，内抓制度管理，清理并逐步解决历史遗留问题以及造成的诸多诉讼问题，企业经营发展逐步在优化，这对借款人的经营发展是相当有利的。
// 2、跟踪一部分他行退出后的续贷问题，同时进行定期与不定期地贷后管理核查，密切关注他行金融机构授信变化情况及变化根本原因。
// 3、密切监控我行信贷资金的流向，确保信贷资金用于采购材料和日常流动资金，做到专款专用；随时关注与下游结算情况。
// 4、由于2019年四季度借款人外部和内部的审查有关，加再上近期疫情的原因，借款人目前经营发展放缓。据借款人高管介绍，目前公司正在实施的PPP项目较多，实施期限相比传统业务工期较长，项目金额较大，短时间内公司的经营收入不会受太大影响。本次贷后据借款人高层介绍，借款人今后的经营策略将不再接手PPP项目类，经营发展方向将重点发展常规性且风险系数评判较低的小型工程施工项目，避免大量流动资金积压，分散经营风险。此情况我部将跟踪调查，严密关注借款经营发展情况的变化。
// 5、上季度贷后中我部调查到，借款人股东四川省煤田地质局已获得四川省农行17.89亿授信，其中流动资金授信额为10亿，项目贷款授信为7.89亿。本次贷后调查了解到，四川省煤田地质局于2019年底获得成都银行10亿和中信银行2亿流动资金授信，这对四川省煤田地质局和借款人来说，较低成本的资金将有助于整个集团的经营发展。本次贷后发现，原授信银行兴业银行和广发银行暂时退出，为补足借款人流动资金需求，四川省煤田地质局提用了农行的流动资金贷款3亿，以往来款的形式借给借款人，成本为农行贷款利率成本5.8%，降低了借款人的财务成本。

// 主客户经理（签字）：            日期：      
// 从客户经理（签字）：            日期：     
// 机构负责人（签字）：            日期：

// 贷后管理报告附件清单（包括但不限于以下资料）：
// 1.更新后的基础情况资料(如有)。根据信贷客户及保证人基本情况的变化，及时收集变更后的营业执照、身份证等相关证照、证件类资料，并在相关系统中作变更处理。
// 2.账户资金监测表（按本办法所附的固定格式模板填写）   
// 3.按月（季）收集的财务报表资料
// 4.《提示归还到期贷款通知书》（如有）
// 5.《提示归还到期贷款（按计划还款）通知书》（如有）
// 6.《催收逾期（不良）贷款本息通知书》（如有）
// 7.借款人征信报告
// 8.还款凭证（如有）
// 9.能证明借款人经营情况、项目进度变化的资料
// 10.其他用于证明贷后检查报告阐述内容的资料。

// `

// let txt2 = `附件3
// 泸州市商业银行
// 贷后管理报告
// （法人客户）
// （2019年四季度）


// 现场检查时间：2019年11月18日（本年第5次现场检查）
// 客户名称：四川中成煤炭建设（集团）有限责任公司
// 填报机构：成分业务五部
// 贷后主客户经理：陈峻平
// 贷后从客户经理：黄非
// 联系电话：17723323122
// 机构负责人：张谦
// 联系电话：18628102625







// 一、借款人基本信息
// （一）借款人目前基本情况
// 借款人四川中成煤炭建设(集团)有限责任公司于1998年5月13日注册，注册资本人民币10060万元，注册地址：成都市青羊区青华路39号，所属行业为建筑施工，2019年6月27日法定代表人正式由原董伦辉变更为柯军，公司主营业务范围：承包与其实力、规模、业绩相适应的国外工程项目。对外派遣实施上述境外工程所需的劳务人员；普通货运。矿山工程、房屋建筑工程、市政公用工程、公路工程、水利水电工程、地基与基础工程、遂道工程、桥梁工程、土方石工程、建筑装修装饰工程、公路路基工程、河湖整治工程、建筑防水工程、防腐保温工程、消防设施工程、金属门窗工程、公路路面工程；地质灾害治理工程监理；进出口业；工程项目管理；装卸搬运。
// 中成建设集团，创始于1992年，于1998年正式成立。中成建设  集团是四川省煤田地质局直属的大型国有施工企业，中成建设集团被中国建筑协会授予“2013年度全国工程建设质量管理优秀企业称号”。中成建设集团自成立以来，积极参与“市政公用工程”建设，跻身于交通、隧道、桥梁、水利等施工领域，并取得了辉煌的成就。在川、渝、陕、晋、皖、内蒙、赣、粤、藏、滇、黔等二十余个省、市、自治区以及成都、重庆、宜宾等大中型城市，承建了许多大中型项目。
// 在工业与民用建筑方面，先后建成了重庆银都公寓、重庆边检大厦、泸州市公安局应急指挥中心大楼、恒基电梯公寓、成都棕北小区、成都近郊金牛农民新居、中铁二局九里欣园及都江堰假日青城别墅、四川省人民政府办公厅地下停车场、四川大学双流校区学生宿舍二组团及教工住宅、西南财经大学绵阳校区第二教学楼及温江校区学生宿舍第二组团、四川师范大学化学楼、锦江区图书馆、四川省政府小礼堂等装饰装修工程。中成建设集团，位于“四川省建筑业先进企业名单”第67位。
//                借款人  股东构成
// 序号	股东名称	出资额 （万元）	股权占比
// 1	四川省煤田地质局	7019.51	69.77%
// 2	成都天辰楼宾馆	1000	9.94%
// 3	四川省煤田地质局一三七队	667.84	6.63%
// 4	四川省煤田地质局一三五队	502.07	4.99%
// 5	四川省煤田地质局一四一队	499.76	4.97%
// 6	四川省煤田地质局地质测量队	141.52	1.41%
// 7	四川煤矿基本建设工程公司	60	0.60%
// 8	四川煤炭综合服务公司	50	0.50%
// 9	芙蓉矿务局芙蓉隧道工程公司	50	0.50%
// 10	成都市煤炭建筑公司	40	0.40%
// 11	芙蓉矿务局建筑安装工程总公司	20	0.20%
// 12	重庆煤矿建筑第五工程处	9.3	0.09%
// 合计	10060	100%
//    申请人的实际控制人为四川省煤田地质局。借款人相关证照及管理层、员工无变化。
// （二）借款人在我行贷款基本情况：
// 序号	业务品种	贷款金额	贷款资金使用情况是否正常	当前贷款余额	担保方式	贷款期限	五级分类形态
// 1	流动资金贷款	15000万	正常	15000万	保证担保	1年	正常
// 合计		15000万		15000万			

// 二、生产经营情况
// 中成建设集团业务区域分布
// 中成建设集团 各地分公司/办事处
// 序号	地域	简介
// 1	北京分公司	北京办事处位于北京市海淀区，现有员工60人，其中专业技术人员20人，主要从事高端经营及全国范围内集团资质许可的工程建设
// 2	云南分公司	云南分公司位于昆明市，现有员工300余人，其中各类专业人员150余人，各类配套施工机械及仪器设备220余台套。
// 3	广西分公司	广西分公司位于南宁市，公司软、硬件设备齐备，拥有各类工程技术人员及员工150余人，拥有各类机械设备170台套。
// 4	陕西分公司	陕西分公司位于西安市，现有员工200余人，其中各类专业人员150余名，各类设备100余台套。主要从事各类工业及民用建筑、市政公用、道路桥梁，金属结构安装。
// 5	广东分公司	广东分公司位于清远市，办公面积500平米，现有业务人员5名，技术人员十余人，高级工程师、专业财务人员各一名。
// 6	第六分公司(水利水电)	第六分公司位于成都市，现有职工200余人，其中专业技术人员80余人，拥有大型设备20余台，中小型设备100余台。
// 7	山西分公司	山西分公司位于太原市，现有员工400余名，其中各类专业技术人员100余名，各类设备90余台。
// 8	贵州分公司	贵州分公司位于贵阳市，现有员工20余名，各类设备10余台。
// 9	内蒙古锡林郭勒盟分公司	内蒙古锡林郭勒盟分公司地处锡林浩特市，现有各类工程机械200余套，各方面工程管理人员50余人。
// 10	其他分公司：泸州分公司、德阳分公司、达州分公司等	　
// 11	驻外办事处：重庆办事处、新疆办事处	重庆办事处从事集团公司资质范围内在重庆建筑市场的经营、施工管理。新疆办事处位于乌鲁木齐市，现有员工120余名，拥有各类大中型机械设备70余套。

// 近两年在执行合同情况：
//                 　　　　  2018年中标合同登记表                 单位：万元
// 编号	项目名称	业主名称	合同金额  
// 1	永胜县程海镇半海子村泥石流治理等4个地灾监理工程	永胜县国土资源局	10.6
// 2	中粮珑悦锦云项目幼儿园精装修工程	成都鹏鼎置业有限责任公司	293.949456
// 3	高新区南部园区大源组团花荫村十二组商业、办公及附属设施项目（兴洲天府三街项目）土石方、基坑支护及降排水工程	成都兴洲数字电视传播有限公司	1399.8095
// 4	中粮御嶺湾会所507、517、553栋库存房品质提升工程	成都天泉置业有限责任公司	36.970187
// 5	祥云里项目桥梁工程	成都怡悦置业有限责任公司	68.282583
// 6	中粮办公室项目精装修工程	成都怡悦置业有限公司、成都鸿悦置业有限公司、成都兴洲数字电视传播有限公司、成都中金澎茂置业有限公司	147.187435
// 7	翠屏区中心城区“城市双修”项目投资建设合作合同	宜宾市翠屏区国有资产经营管理有限责任公司	25000
// 8	寿安污水管网整治工程	成都城西城市投资经营中心	1060.03
// 9	蓬安县锦屏新区干道改造工程项目城市地下综合管廊建设项目	蓬安县吉兴矿业开发有限责任公司	27479.56
// 10	2018-2019年剥离工程（三标段）	内蒙古平西白音华煤业有限公司	36907
// 11	锡林郭勒盟乌兰图嘎煤炭有限责任公司锗煤露天矿原煤破碎筛分工程及补充合同	锡林郭勒盟乌兰图嘎煤炭有限责任公司	单价包干3.91/T
// 12	白草尾矿库排洪系统改造升级工程	会理县财通铁钛有限责任公司	700
// 13	天府新区青龙苑区商品房项目-施工总承包EPC	四川煤田恒鑫房地产开发有限公司	59159.95991
// 14	平昌县西兴镇、龙岗镇、土垭乡、佛楼镇、高峰乡城乡建设用地增减挂钩项目建设工程	四川煤田美丽乡村土地整理有限公司	48000
// 15	攀钢集团攀枝花新白马矿业有限责任公司田家村采场采剥工程2018年合同及补充协议1、非煤矿山安全生产管理协议（2018.1.1-2018.12.31）、治安保卫协议、廉洁协议	攀钢集团攀枝花新白马矿业有限责任公司	单价包干
// 16	双流区永安镇梨园村农民集中建房项目I标段	成都双流梨花湾土地股份合作社	2229.9
// 17	中粮宸悦华庭项目土方分包工程	中建三局集团有限公司	73.832898
// 18	山西省采煤沦陷区综合治理大同煤矿集团雁崖煤业有限公司地质环境治理项目施工监理	大同市国土资源局云冈分局	9.1
// 19	泸县公共医疗卫生PPP项目框架协议、合同协议书	泸县人民政府、泸县卫生和计划教育局	109981.6
// 20	乔庄镇及贫困村安全饮水项目	青川县洁康水务投资有限公司	667.88
// 21	龙涧书苑房地产开发项目勘察设计施工总承包	泸州鼎诺房地产开发有限责任公司	建安下浮8%
// 22	东湖山生态修复（环湖彩林改造一期）（疏林草地改造一期）（东门入口生态环境改造）监理服务项目	德阳市公园管理处	2.015415
// 23	中粮地产祥云里项目样板房装修工程	成都怡悦置业有限公司	15.350203
// 24	山西潞安环保能源开发股份有限公司五阳煤矿地质环境治理项目监理（二标段）	襄垣县国土资源局	24.8
// 25	万寿苑（清水苑）商品住宅楼项目总平整改及围墙改建工程	四川省蜀府房屋建设开发有限公司	147.8706
// 	合计		343415.7

// 截止到2019年11月施工合同进度表（含以往未执行完毕的合同） 金额：万元
// 中成集团在履约及尚未履约的主要工程项目
// 序号	主要项目名称	业主	合同总额（万元）	工期	累计已完成施工产值（万元）	工程进度
// 1	保利心语南侧中学工程	成都高投建设开发有限公司	   14,340.04 	540	11,902.23 	83.00%
// 2	攀钢集团攀枝花新白马矿业有限责任公司田家村采场采剥工程项目2014	攀钢集团攀枝花新白马矿业有限责任公司	    5,920.00 	　	4,499.20 	76.00%
// 3	忠县半城新区西流村拆迁安置及安居房项目（一标段）	重庆忠文化投资发展有限公司	    8,501.16 	730	7,821.06 	92.00%
// 4	山西离柳焦煤集团有限公司宏岩煤矿二期井巷工程	山西离柳焦煤集团有限公司	    3,374.85 	210	2,868.62 	85.00%
// 5	清远市清新区市政设施维护服务资格采购项目	清远市清新区城市综合管理局	 4.5%下浮 	1+2年	2611.38 	67.00%
// 6	344国道石家映至千阳公路改建工程	陕西省宝鸡公路管理局	    4,246.88 	270	3,652.32 	86.00%
// 7	西北工业大学友谊小区北村住宅改造（二期）	西北工业大学	   18,595.76 	960天	13,760.86 	74.00%
// 8	国家物资储备西部核心物流基地项目施工II标段	陕西储备物资管理局五三三处	   14,528.18 	480	11,331.98 	78.00%
// 9	绵阳党史档案组团二标段	绵阳富达资产经营有限责任公司	    9,001.81 	　	8551.72	95.00%
// 10	绵阳市游仙区科学城快速通道（PPP模式）（主合同及与中联惠合同）	绵阳市游仙区政府	   49,500.00 	建设期2年	47,025.00 	95.00%
// 11	威远县2014年棚户区改造项目B区配套工程及补充协议	威远投资控股集团有限责任公司	    2,616.05 	720	2,171.33 	83.00%
// 12	巴中经济开发区西片区道路建设项目（10路、11路、22路）标段施工	四川巴中新城建设投资有限公司	    1,390.77 	150	1,126.52 	81.00%
// 13	金堂大道三星至高板段建设工程（K20+500-K22+400\K23+100-K24+330,六标段）	成都宜居水城城乡交通建设投资有限公司	    5,858.34 	　	3,632.17 	62.00%
// 14	成都轨道交通18号线工程土建1标降水井机械设备作业工程分包合同	中国水利水电第七工程局成都水电建设工程有限公司	      175.96 	　	128.45 	73.00%
// 15	成都轨道交通18号线工程土建1标围护桩机械设备作业工程分包合同	中国水利水电第七工程局成都水电建设工程有限公司	    1,439.22 	　	762.79 	53.00%
// 16	大藤峡船闸及南木江副坝基础处理工程分包合同	中国葛洲坝集团第一工程有限公司大藤峡船闸及副坝工程施工项目部	    2,092.49 	36个月	1,611.22 	77.00%
// 17	天府二街（大源中央公园段）人行天桥	成都高投建设开发有限公司	    2,751.63 	180	2,366.41 	86.00%
// 18	重庆大学成树人小学及幼儿园主体工程桩基础增量工程补充施工合同	沙坪坝区教育委员会	    6,059.43 	　	4,968.73 	82.00%
// 19	S309线乐自高速贡井区连接线段新建工程PPP项目	贡井区交通运输局	   40,782.18 	　	33,849.21 	83.00%
// 20	塞纳国际四期9号楼工程	宜宾德通房地产开发有限公司	    2,725.89 	730	2,426.05 	89.00%
// 21	彭州丽春镇航空动力产业功能区新居工程勘察、设计、施工一体化总承包合同	彭州工业投资发展有限责任公司	   11,389.49 	　	6,036.43 	53.00%
// 22	塞纳国际四期4号楼及地下室工程	宜宾德通房地产开发有限公司	    7,818.41 	730	5,785.63 	74.00%
// 23	宜宾县金沙江左岸四期防洪护岸综合整治工程PPP项目	宜宾县水务局	   44,631.98 	建设期3年	5,355.84 	12.00%
// 24	“塞纳国际”商住小区五期建设项目	宜宾德通房地产开发有限公司	   13,489.24 	　	11,600.75 	86.00%
// 25	安岳县农村公路项目（一期）PPP	安岳县交通运输局	   28,583.92 	建设期2年	7,717.66 	27.00%
// 26	元宝山露天煤矿2017年生产采选工程一标段续签合同	内蒙古平庄煤业（集团）有限责任公司元宝山露天煤矿	 按实结算 	　	9,876.43 	　
// 27	山西离柳焦煤集团有限公司宏岩煤矿三期井巷工程	山西离柳焦煤集团有限公司	    5,068.43 	　	4,409.54 	87.00%
// 28	永胜县程海镇半海子村泥石流治理等4个地灾监理工程	永胜县国土资源局	       10.60 	　	4.77 	45.00%
// 29	中粮珑悦锦云项目幼儿园精装修工程	成都鹏鼎置业有限责任公司	      293.95 	　	132.28 	45.00%
// 30	高新区南部园区大源组团花荫村十二组商业、办公及附属设施项目（兴洲天府三街项目）土石方、基坑支护及降排水工程	成都兴洲数字电视传播有限公司	    1,399.81 	　	503.93 	36.00%
// 31	白草尾矿库排洪系统改造升级工程	会理县财通铁钛有限责任公司	      700.00 	　	364.00 	52.00%
// 32	翠屏区中心城区“城市双修”项目投资建设合作合同	宜宾市翠屏区国有资产经营管理有限责任公司	   25,000.00 	　	23,750.00 	95.00%
// 33	寿安污水管网整治工程	成都城西城市投资经营中心	    1,060.03 	　	678.42 	64.00%
// 34	蓬安县锦屏新区干道改造工程项目城市地下综合管廊建设项目	蓬安县吉兴矿业开发有限责任公司	   27,479.56 	　	11,816.21 	43.00%
// 35	2018-2019年剥离工程（三标段）	内蒙古平西白音华煤业有限公司	   36,907.00 	　	28,787.46 	78.00%
// 36	金牛区成华南街等26项排水管网病害整治非开挖技术修复治理服务项目	成都市金牛区统筹城乡和水务局	2128.42	　	2022.00	95.00%
// 37	峨胜采矿场1200万吨/年扩大开采范围技改工程石灰石破碎及运输系统项目	四川峨胜水泥集团股份有限公司	据实核算	　	2600	　
// 38	成都市排水设施管理处成华南路街12条排水管网病害治理维护工程项目	成都市排水设施管理处	459.14	　	436.183	95.00%
// 39	古蔺县重点扶贫农村公路顺秋亭至桂花、头道河至双沙改建工程	古蔺县蔺州干线公路建设有限公司	24659.23	　	1232.9615	5%
// 	合计		424979.87		290177.74	

// 以上工程情况表为借款人能提供的最详尽的表格数据，除PPP项目以外，上表中“翠屏区中心城区“城市双修”项目投资建设合作合同”、“蓬安县锦屏新区干道改造工程项目城市地下综合管廊建设项目”、“天府新区青龙苑区商品房项目-施工总承包EPC”、“天府二街（大源中央公园段）人行天桥”为EPC项目,其它为一般性施工工程。
// 借款人部分分公司、项目公司结算和纳税是属地化，公司本部主要结算行为建行一支行和建行岷江支行，故借款人报表显示2018年全年收入23.19亿，纳税额为111822.04亿为本部纳税收入。另外，借款人增值税申报表上的收入要跟开具的发票直接相符，而会计上确认收入借款人按照权责发生制，造成会计报表收入与税务申报收入的不同，因此未在纳税申报表收入上体现。截至目前，部分工程，例如绵阳、自贡、宜宾PPP项目工程部分收入均未开具发票，其他施工工程，亦存在这种现象。（建筑企业普遍存在这种现象，按完成节点确认收入，但只在最后一次性开具发票，目的：1：延缓交税；2：方便与甲方业主单位确认最终开票金额）。2018年新增工程合同金额约34.34亿元，截止2019年11月，未执行完合同主要为投融建和PPP模式的大型房、基础设施等项目。其中比较典型的PPP项目有：
// 绵阳市游仙区科学城快速通道，项目总投资69500万，SPV公司为四川中联惠建设工程有限公司为我行授信客户，授信金额60000万，目前已投放55000万。　　
// 宜宾县宜宾县金沙江左岸四期防洪护岸综合整治工程PPP项目，项目总投中施工合同金额44631.98万元，SPV公司为四川德泽君建设有限公司，成立于2017年9月13日，注册资金5000万，由借款人与宜宾县城市建设投资开发有限责任公司组建，该项目目前处于实施阶段，目前借款人正与宜宾金江农商行对接项目融资事宜，项目贷款已下批复，批复贷款金额45500万元，拟于2019年9月11日已经签订合同并提款3000万，贷款年限13年，因须在枯水期施工，故近期才提款施工。
// 自贡市的S309线乐自高速贡井区连接线段新建工程PPP项目，项目总投中施工合同金额为40782.18万元，SPV公司为自贡成鑫交通建设工程有限公司，成立于2017年7月11日，注册资金5000万，由借款人与自贡路鑫交通建设工程有限公司组建，该项目目前处于执行阶段，项目资本金已投入14506.57万，中成已投入13781.24万，农业银行已授信5.8亿，已发放贷款金额5亿。
// 四川省安岳县农村公路项目（一期）PPP合同，项目总投中施工合同金额为28583.92万元，SPV公司为四川中惠岳建设工程有限责任公司，成立于2017年12月22日，注册资金1000万，由借款人与安岳县交通投资开发有限责任公司组建，该项目目前处于实施阶段，进度情况见上表。目前借款人正与安岳农发行对接项目融资事宜，项目贷款已经于2019年10月过会，申报金额2.5亿，近期将下批复。
// 泸州市龙城中汇建设有限公司，注册资金5000万，2018年12月7日成立，法定代表人纪号彪，中成建设集团持该公司38.94%股权。泸州市龙城中汇建设有限公司为执行泸县公共医疗卫生PPP项目而成立，注册地址为四川省泸州市泸县玉蟾街道建设社区泸泉路13-2-600附201-205号。该项目目前处于实施阶段，截止本报告日资本金投入已超过10500万，农发行泸县支行8.79亿贷款已2019年6月19日下发批复，贷款年限15年，并于2019年9月24日签订了借款合同，利率为LPR报价五年档次加103个基点，并于2019年11月1日投放了4282万。
// 本季度贷后环比上季度贷后，借款人主要增加了“古蔺县重点扶贫农村公路顺秋亭至桂花、头道河至双沙改建工程”施工项目，工程合同总额24659.23万，该项目为政府专项资金，模式为常规施工模式。
// 2017年以来，借款人所承接工程绝大多数都为中长期项目，主要为PPP项目和EPC项目，占用资金量较大，承接的工程大多数都是两至三年的建设期，为求按时保质保量完成2015年所承接工程项目，2017年以来，借款人适度择优承接新项目，目前PPP项目和投融建项目执行情况较为良好。但经本次贷后调查与企业管理层沟通，借款人本年度中旬后，因外部及内部审查，经营放缓，新增合同量较少，目前主要保证所期所承接的项目的正常完工。此情况我部将跟踪调查，严密关注借款经营发展情况的变化。

// 三、财务状况分析
// （一）基本财务信息分析
// 由于借款人为大型国有企业，不出具月报，出具季报，截止贷后报告日，借款人2019年第三季度报表暂未出，故借款人2019年第二季度报表及2018年年末报表数据如下：

// 资产负债表
// 项目	2018年期末	2019年6月	项目	2018年期末	2019年6月
// 货币资金	4709.18	9489.39	银行借款	49000	61300
// 短期投资	0	0	应付票据	0	20676.91
// 应收票据	6517.00	58289.99	应付账款	29358.61	
// 应收账款	52301.87		预收账款	26642.94	31546.57
// 应收股利	0	0	应付工资	95.21	9.02
// 其他应收款	45159.16	47277.14	应付福利费	0	0
// 预付账款	3488.49	3849.54	应付利润	0	0
// 期货保证金	0	0	应付利息	0	0
// 应收补贴款	0	0	应交税费	-1586.75	-2423.13
// 应收出口退税	0	0	其他应交款	0	0
// 存货	37975.73	30900.09	其他应付款	26547.86	20509.71
// 待摊费用	0		预提费用	0	0
// 待处理流动资产净损失	0		预计负债	0	0
// 一年内到期的长期债权投资	0		递延收益	0	0
// 其他流动资产	16.74	16.74	一年内到期的长期负债	0	0
// 流动资产合计	150168.18	149822.89	其他流动负债	0	0
// 长期投资	18328.89	20975.89	流动负债合计	130057.87	131619.09
// 其中：长期股权投资	18328.89	20975.89	长期借款	0	0
// 长期债权投资	0	0	应会债券	0	0
// 长期应收款	89157.94	74999.64	长期应付款	8665.06	10295.93
// 固定资产原价	21216.64	22350.02	专项应付款	0	0
// 减：累计折旧	11581.37	13223.72	其他长期负债	0	0
// 固定资产净值	9635.26	9126.29	长期负债合计	8665.06	10295.93
// 减：固定资产减值准备	0	0	负债合计	138722.93	141915.02
// 固定资产净额	9635.26	9126.29	少数股东权益	0	0
// 在建工程	0	0	实收资本	10060	10060
// 无形资产	0	0	其中：国家资本	0	0
// 递延资产	0	0	　　　集体资本	0	0
// 递延税款借项	0	0	　　　法人资本	10060	10060
// 资产总额	267290.27	274924.72	　　　个人资本	0	0
// 			　　　外商资本	0	0
// 			资本公积	12.02	12.02
// 			盈余公积	26434.14	26434.14
// 			未分配利润	92061.19	96503.54
// 			外币报表折算差额	0	0
// 			所有者权益合计	128567.35	133009.7
// 			负债和所有者权益合计	267290.27	274924.72
// 利润表
// 	2018年期末	2019年6月			
// 一、主营业务收入	231915.33	110929.03			
// 二、营业总成本	212278.66	105454.21			
// 其中：减：主营业务成本	197283.37	101190.66			
// 减：主营业务税金及附加	7391.49	515.64			
// 减：经营费用	0	0			
// 减：其它	0	0			
// 加：递延收益	0	0			
// 加：代购代销收入	0	0			
// 加：其他	0	0			
// 加：其它业务利润	34.84	0			
// 减：营业费用	0	0			
// 减：管理费用	3524.98	1482.42			
// 减：财务费用	4078.81	2265.48			
// 减：其他	0	0			
// 四、营业利润	19671.52	5474.82			
// 加：（一）投资收益	0	0			
// 　 （二）期货收益	0	0			
// （三）补贴收入	0	0			
// （四）营业外收入	7.53	0			
// 　 （五）其他	0	0			
// 减：（一）营业外支出	16.77	0.01			
// （二）其他支出	0	0			
// 五、利润总额	19662.28	5474.81			
// 减：所得税	4915.57	1032.46			
// 六、净利润	14746.71	4442.35			

// 因2019年6月末报表暂无附注，本月贷后只特别调查了报表中变化较大的科目，其余科目以2018年末数据作分析。
// 货币资金(万元)
// 	2016年	2017年	2018年	2019年6月
// 货币资金 	5450.92	5619.3	4709.18	9489.39
// 货币资金主要是银行存款及库存现金,其中银行存款为9489.39万元，无受限资金。
// 应收账款及应收票据(万元)
// 	2016年	2017年	2018年	2019年6月
// 应收账款	38744.92	52165.39	52301.87	58289.99
// 中成建设集团为国有企业，发展相对稳健。对承接的工程选择较为严格，垫资较大的工程一般不接，尽量减少发包方对公司资金的占用。煤田地质局对下属单位财务管理较为严格，特别是工程回款，要求严格按照合同约定、进度执行，每个项目均安排了专人负责催收工程款。随着公司承接工程量的增加，应收账款余额增涨较快。中成建设集团为国有企业，发展相对稳健。对承接的工程选择较为严格，垫资较大的工程一般不接，尽量减少发包方对公司资金的占用。煤田地质局对下属单位财务管理较为严格，特别是工程回款，要求严格按照合同约定、进度执行，每个项目均安排了专人负责催收工程款。所以，较一般国有建筑类企业而言，中成建设集团工程款回收效果较好。
// 其他应收款(万元)
// 	2016年	2017年	2018年	2019年6月
// 其他应收款	47183.12	50836.31	45159.16	47277.14
// 主要为内部往来款及履约保证金，2019年6月暂无科目明细，故列明2018年年末主要债务人明细。2019年6月末较2018年末变化不大。
// 2018年末前十大其他应收款明细
// 名称	金额	款项性质
// 绵阳惠东投资控股有限责任公司
// 	5000.00	其他
// 四川中成煤田投资有限责任公司	4563.32	内部往来
// 内蒙古鑫昊建设工程有限公司	2813.00	往来
// 锡林郭勒盟鑫昊工贸有限责任公司	2504.00	往来
// 彭州市丽春新居工程	2365.56	项目材料预付款
// 新白马田家村采场铲装运项目	2291.23	项目材料预付款
// 内蒙古煤建设工程有限公司	2000.00	履约保证金
// 成都中冶田园世界置业有限公司	1500.00	履约保证金
// 成都市五大花园地区基础设施建设投资有限公司
// 	1260.62	履约保证金
// 天辰楼
// 	1000.00	内部往来
// 合计

// 	25297.74
	
// 其他应收款资金主要为项目质保金、投标保证金、履约保证金、备用金等以及关联公司的一些往来款项，其中项目材料预付款为垫付资金。除以上前十大其他应收款外，其他应收款较为零散，多达上百项，账龄在一年以内的占74.96，未有坏账准备。
// 存货(万元)

// 存货	2016年	2017年	2018年	2019年6月
// 原材料	9892.64	9391.62	7528.31	30900.09
// 未结转工程成本	33230.74	36824.91	30447.42	
// 合计	43123.38	46216.53	37975.73	30900.09
    
// 以上数据为存货账面价值，未作跌价准备，存货主要是原材料和未结转工程成本。
// 长期应收款 (万元)
// 　	2016年	2017年	2018年	2019年6月
// 其他长期资产	63871	77412.24	89157.94	74999.64
// 2018年年末及2019年6月末其它长期资产主要单位如下：
// 客户名称	2018年末	2019年6月
// 四川省乐至县交通投资开发有限责任公司	1571.00	1571.00
// 四川省煤田地质局	3800.00	3800.00
// 四川中成煤田投资有限责任公司	44000.00	24000.00
// 四川中联惠建设工程有限公司	8010.00	8010.00
// 自贡成鑫交通建设工程有限公司	9031.24	9031.24
// 四川德泽君建设有限公司	6500.00	6500.00
// 四川煤田恒鑫房地产开发有限公司	7500.00	6900.00
// 四川中惠岳建设工程有限责任公司	3745.7	8045.7
// 四川煤田美丽乡村土地整理有限公司	5000.00	5000
// 泸州市龙城中汇建设有限公司		2141.7
// 合计	89157.94	74999.64
// 据调查，2019年6月末科目调整，长期应收款为2018年末的其他长期资产， 2019年6月暂无科目明细，但此科目增加较大，故作单科目调查。2019年6月较2018年末长期应收款减少14158.3万元，主要是四川中成煤田投资有限责任公司的往来款减少了20000万元，四川煤田恒鑫房地产开发有限公司减少了600万元，四川中惠岳建设工程有限责任公司增加了4300万元，另外增加了PPP项目公司泸州市龙城中汇建设有限公司2141.7万元。
// 其他长期资产实质是长期应收款。其中数额较大的主要是关联公司四川中成煤田投资有限责任公司、四川中联惠建设工程有限公司、自贡成鑫交通建设工程有限公司、四川煤田恒鑫房地产开发有限公司、四川德泽君建设有限公司、四川煤田美丽乡村土地整理有限公司的往来款。
// 长期股权投资 (万元)
// 　	2016年	2017年	2018年	2019年6月
// 长期股权投资	9420.7	16774.59	18328.89	20975.89
// 2018年年末及2019年6月末其它长期资产主要单位如下：
// 客户名称	2018年末	2019年6月
// 四川省泸州市一三五岩土工程有限公司	1094.19	1094.19
// 四川省煤田地质一三七总公司	1094.19	1094.19
// 四川省煤田地质局一四一开发总公司	556.21	556.21
// 四川华源矿业勘查开发有限责任公司	100.00	100.00
// 四川中联惠建设工程有限公司	4500.00	4500.00
// 自贡成鑫交通建设有限公司	4750.00	4750.00
// 四川煤田大地投资公司	180.00	180.00
// 四川德泽君建设有限公司	4500.00	4500.00
// 四川中惠岳建设工程有限责任公司	954.3	954.3
// 四川煤田美丽乡村土地整理有限公司	600.00	600.00
// 四川众城房地产开发有限公司		700.00
// 泸州市龙城中汇建设有限公司		1947.00
// 合计	18328.89	20975.89

// 由于客户所处行业为建筑行业，建设项目经营周期一般较长，其指标变化不大，属于正常状态。
//     2016年12月的财务报表：资产总额219308.90万元，负债总额121070.28万元，短期借款53000.00万元，净资产98238.61万元，主营业务收入234208.34万元，利润总额17127.19万元。
// 2017年12月财务报表：资产总额263213.34万元，负债总额149392.7万元，短期借款60000万元，净资产113820.64万元，主营业务收入222995.51万元，利润总额19198.32万元。
// 2018年12月财务报表：资产总额267290.27万元，负债总额138722.93万元，短期借款49000万元，净资产128567.35万元，主营业务收入231915.33万元，利润总额19662.28万元。
// 2018年12月偿债指标中：资产负债率52%，流动比率115.46%，速动比率84%，大大优于该行业平均比率。营运指标：总资产周转率87%，流动资产周转率151%，应收账款周转率444%，存货周转率469%，处于行业较高值。盈利指标：销售增长率4%，销售利润率8.48%，总资产报酬率9%，净资产收益率12%，都略高于行业平均值。
// 2019年6月财务报表：资产总额254924.72万元，负债总额141915.02万元，短期借款61300万元，净资产133009.7万元，主营业务收入110929.03万元，利润总额5474.81万元。

// （二）对外融资和担保情况
// 1、对外融资情况
// 经2019年11月13日查询借款人征信，借款人贷款合计45506.77万元，比上季度贷后减少了8600万，主要是兴业银行8000万贷款收回，平安国际融资租赁有限公司的贷款减少500万，重庆银行贷款减少100万，详细授信情况如下：
// 我行贷款余额15000万元，其中9000万元期限为2019年4月29日至2020年4月29日；其中6000万元期限为2019年5月6日至2020年4月29日。
// 光大银行流动资金贷款10000万元，其中6000期限为2019年1月2日至2020年1月1日；其中4000期限为2018年12月24日至2019年12月23日。
// 中信银行流动资金贷款10000万元,期限为2018年11月30日至2019年11月30日。
// 渤海银行流动资金贷款5000万，期限为2019年2月18日至2020年1月29日。
// 重庆银行流动资金贷款3200万，期限为2019年3月25日至2021年3月24日，比上季度贷后减少100万。
// 平安国际融资租赁有限公司2306.77万元，其中806.77万期限为2018年06月29日至2021年06月29日；其中750万期限为2018年04月11日至2021年04月11日；其中750万期限为2018年03月30日至2021年03月30日。
// 借款人无对外担保记录。

// 2、对外担保情况如下
// 借款人无对外担保记录。

// 四、客户资金账户监管
// 1、资金回行情况：
// 当季纳税情况调查
// 现金流量表中“销售商品、提供劳务收到的现金”科目余额	2018年12月报表反映该科目为251268.02万（季报无现金流量表）
// 税单/防伪税控开票子系统反映的纳税收入额	2019年9月纳税收入额为60388.05万元（2019年9月本部）
// 主要银行账户流水中反映的经营收入额（含我行经营流水）	2019年7月至9月年累计主要银行账户流水为19795.77万元
// 我行资金回行情况
// 事项时段	月度	季度	年度	贷款发放日（2019年4月29日）至检查日
// 回行（剔除非经营性流入）	2019年7月10627.5万
// 2019年8月288万
// 2019年9月2553.76万	2019年三季度3469.26万	2019年1月1日至2019年9月30日6723.24万	2019年4月29日至2019年11月14日15956.29万
// 日均	2019年7月547.72万
// 2019年8月483.61万
// 2019年9月590.59万	540.1万	444.02万	642.21万

// 2、根据我行与借款人所签订的编号为“沪商成分业务五部账监2019年第16号”《账户监管协议》第1.1条、第4.4条约定：“借款人必须保证监管账户资金的季流入量不低于当季第1.1条所述收入的10%”，从2019年4月29日和2019年5月6日分别发放了9000万和6000万贷款（回收再贷），之前与借款人沟通的按新签订的《账户监管协议》要求按比例进行资金回笼，目前此情况已得到改善，并承诺以后也将要求其严格按照《账户监管协议》约定在我行进行资金回笼。
// 3、监控客户账户未发生查封、冻结或扣划等严重影响我行信贷资金安全的事件。

// 五、贷款担保状况分析
// 客户使用信用，追加保证，追加保证人基本情况较保前无明显变化。保证人成立于2011年，成立时间相对较短。但保证人成立之初就被赋予了相对明确的职责，肩负着管理职能和服务职能，包括战略管理、资产管理、目标管理、投资决策等。中成投资公司董事长兼任四川省煤田地质局局长，中成投资公司在煤田地质局内占据重要的管理地位。煤田地质局自1953年成立以来，为四川省乃至西南地区的地质工作做出了巨大的贡献，特别是在煤矿等矿产资源方面具有得天独厚的优势。中成投资公司作为煤田地质局的投资项目管理者，其本身的管理能力、经营能力都是出类拔萃的。
//     2017年12月的财务报表（合并）：资产总额388352.01万元，净资产214292.33万元，主营业务收入297547.97万元，利润总额40865.07万元。
// 2018年12月报表（合并）：资产总额388554.71万元，净资产240933.72万元，主营业务收入304277.51万元，利润总额39343.16万元。
// 2018年12月偿债指标中：资产负债率37%，流动比率204.01%，速动比率137%，优于该行业平均指标。短期偿债能力较强。
// 2019年6月报表（合并）：资产总额385981.08万元，净资产247038.65万元，主营业务收入117998.42万元，利润总额7191.47万元。
// 截止2019年11月13日担保人对外保证担保余额为43200万元，全部为针对关联企业借款人四川中成煤炭建设（集团）有限责任公司的担保。担保对应的贷款如下：
// 我行贷款余额15000万元，其中9000万元期限为2019年4月29日至2020年4月29日；其中6000万元期限为2019年5月6日至2020年4月29日。
// 光大银行流动资金贷款10000万元，其中6000期限为2019年1月2日至2020年1月1日；其中4000期限为2018年12月24日至2019年12月23日。
// 中信银行流动资金贷款10000万元,期限为2018年11月30日至2019年11月30日。
// 渤海银行流动资金贷款5000万，期限为2019年2月18日至2020年1月29日。
// 重庆银行流动资金贷款3200万，期限为2019年3月25日至2021年3月24日，比上季度贷后减少100万。


// 担保能力测算：
// 担保人2019年6月合并报表净资产247038.65万元－对外保证担保余额为43200万元＝203838.65万元。
// 本次贷款主要以信用为主，担保方式为追加担保人保证担保。
// 六、对内外部检查的整改、审批要求等贷后落实情况
// 审批贷后管理要求如下：
// 根据2019年4月28日泸州银行信贷业务审批书（编号：成都分行（2019）7号）贷后管理要求：
// （一）借款人及集团相关：密切关注其承建项目的建设情况，工程进度、施工安全等情况，全面掌握借款人工程款的回收进度；重点掌握借款人合同履约情况及新合同的签订情况；掌握借款人资产、负债、征信、对外担保、现金流等变化情况，并按季收集融资人的财务报告，分析其经营情况及财务情况；督促借款人严格履行《账户监管协议》，对大额资金走向进行分析，是否存在异常；密切关注借款人涉诉案件进展和变化情况，若出现大额涉诉或被执行案件，应及时采取风险防范措施；密切关注关联企业占用资金的情况和资金回收情况（特别是应收四川中成煤田投资有限责任公司4.4亿元款项）；关注借款人子公司、关联公司的PPP、投融建等项目的融资和实施情况，关注项目资本金到位情况、融资情况、政府付费情况；关注借款人集团公司的经营变化、盈利能力变化及他行对该客户的信贷政策变化等情况，如出现其他金融机构大额压缩贷款的情况，须及时风险预警并采取风险防范措施；关注新到位管理人员对公司的管理政策及管理人员变动情况。
// （二）担保人相关：加强与保证人的联系，掌握保证人资产、负债、信用信息、对外担保、现金流等变化情况，并按季收集保证人财务报告，分析其经营情况、财务情况及代偿情况，与担保人共同督促借款人还本付息。
// （三）外部环境相关：应密切关注建筑施工行业和PPP政策变化、市场变化对借款人的影响。

// 七、还款执行情况
// 根据信贷客户合同约定及规定的还款计划，借款人履约情况良好，按合同约定的计划还本付息。
// 归还时间	归还金额（万元）	是否按计划归还
// 2020年4月29日	15000	未到期
// 合计	15000	

// 八、其他情况
// 2019年11月7日通过中国裁判文书网、天眼查查询，借款人共633条法院判决信息，其中610条均为劳务纠纷与合同纠纷，我部逐条排查，均属并无重大影响企业经营的案件；另外有23条与民间借贷有关案件裁定，据核实，该18中一部份是信息录入归类错误，实为施工合同经济纠纷，剩余部分实际非借款人发生的借贷关系，主要是项目公司的负责人个人借贷关系；另外有2条属第三方案件，与借款人无关。
// 通过全国被执行人网查询，借款人被执行人信息有3条：
// 1、立案时间2019年10月12日，案号：（2019）川1702执1681号，执行法院：达州市通川区人民法院，执行标的：300000元。
// 2、立案时间2017年3月16日，案号：（2017）川0402执518号，执行法院：攀枝花市东区人民法院，执行标的：58300元，未履行金额58300元。
// 3、立案时间2017年7月4日，案号：（2017）黔0302执1875号，执行法院：遵义市红花岗区人民法院，执行标的：3105700元，未履行金额1931032元。
// 据调查，以上执行信息是借款人项目管理问题导致，涉案金额不大，此事借款人正在解决之中。
// 通过失信被执行人网查询：借款人无失信被执行人记录。查询2018年“关于转发失信被执行人名单信息的通知”中申请人及其股东、关联公司均未记录。
// 通过国家企业信用信息公示系统对借款人情况进行了核实，情况如下：（1）公示系统显示的信息与营业执照记载内容一致；（2）企业公示信息：无行政处罚、无知识产权出质登记信息。（3）工商行政管理部门公示的相关信息有登记信息、备案信息，无经营异常信息、无严重违法信息、无抽查信息。
// 通过查询主要关联公司四川中成煤田投资有限责任公司银行征信，2019年11月13日企业信用报告显示：
// 中成投资无借款记录，对外担保责任余额43300万元，主要是对借款人的连带责任担保，信用良好。
// 2019年11月7日通过中国裁判文书网查询、天眼查查询，担保人共56条法院判决信息，其中担保人作为第三方的有5条，其余51条为担保人作为投资纠纷的原告，且案件诉讼期都较长，对目前来说，不会对企业经营产生重大影响。
// 2019年11月7日通过全国被执行人网查询和失信被执行人网查询，担保人有一条被执行人信息，立案时间2019年8月15日，案号：（2019）川01执2648号，执行法院：成都市中级人民法院，执行标的：25767497元。无失信被执行人信息。该案由是四川物流物资贸易有限公司与四川中成恒通贸易发展有限责任公司钢材贸易合同纠纷，四川物流物资贸易有限公司销售货款金额本金为30566844.77元的钢材给四川中成恒通贸易发展有限责任公司，并由四川中成煤田投资有限责任公司承担连带清偿责任，四川中成恒通贸易发展有限责任公司未支付货款给四川物流物资贸易有限公司，四川物流物资贸易有限公司于2018年7月2日对四川中成恒通贸易发展有限责任公司及四川中成煤田投资有限责任公司提起诉讼，判定四川中成恒通贸易发展有限责任公司及四川中成煤田投资有限责任公司支付货款金额本金30566844.77元，支付截止自2016年6月30日的货款加价款13192564.36元，支付自2016年7月1日起至2018年6月30日止利息6333916.9元。截止2018年7月24日，尚欠货款本金25566844.77元，利息19526481.26元，合计45093326.03元。截止目前，被告方最终还尚上述执行金额25767497元。经调查了解，四川中成煤田投资有限责任公司确认案件事实与金额，将于近期偿还该款项。
// 借款人实际控制人四川省煤田地质局为成都市4大省直属局级事业单位，征信无法查询。

// 九、风险因素分析
// 1、政策风险：建筑企业在工程项目实施过程中，由于政府的强势地位容易导致项目运作过程中决策的随意变更，还有诸如政府换届导致的政策不连续等，会在项目实施的不同阶段给企业带来困扰。
// 2、经营风险：借款人目前经营发展放缓，跟前期外部和内部的审查有关，短期内公司经营发展受影响，新增业务减少。另外，借款人所投资的SPV公司四川中联惠建设工程有限公司所实施的绵阳市游仙区科学城快速通道PPP项目，该项目公司为我行授信客户，授信金额60000万，最终实现投放55000万，该项目贷款第一次按计划回收时间点为2019年3月31日，后经SPV公司及绵阳市游仙区政府提出申请，变更第一次还款计划时间点为2019年7月1日。但由于政府最终未按变更后的还款计划全额付费给SPV公司，实际付费金额为4000万元，剩余1917万元由借款人垫付，实质上绵阳市游仙区政府已经未按约定全额付费。详细情况见四川中联惠建设工程有限公司2019年四季度贷后报告。借款人实施中的PPP施工项目共计五个，政府PPP项目是否能按约付费，直接会对借款人的资金流造成严重影响，最终将影响借款人在我行的流动资金贷款的偿还。
// 3、工程建设风险：工程项目管理粗放，精细化程度低下，人员质量、安全意识不强，管理能力不足，现场管理不到位等，都可能导致工程质量或安全出现问题，一旦出现问题，将使企业蒙受相应的经济、效益和信誉损失。
// 4、财务风险：企业筹资决策不当引发资本结构不合理或无效融资，使企业融资成本过高；投资决策失误、资金调度不合理、运营不畅等都可能导致企业陷入财务危机。
// 6、管理风险：2019年6月28日，借款人原董事长、总裁陈隆德因严重违法违幻，被甘孜州监委立案调查，相关信息已经公示。借款人随后对外说明，陈隆德违法属个人行为，且借款人高管为任命制，对借款人经营无重大影响。但该事件导致外部行政机构对整个四川省煤田地质局进行审查，导致目前借款人经营发展放缓，借款人目前新增业务很少，对未来的经营发展造成明显的影响。
// 7、其它风险：借款人行业为建设施工，经营过程中各种法律较多，本次贷后发现借款人裁判文书信息达633条之多，主要是合同纠纷案，在管理和运营发展过程中，有可能造成不可预计的经营风险和赔偿风险。据借款人管理层说明，本次贷后法律诉讼情况，多数为前期管理不善造成的法律相关问题而集中在近期暴发，目前正在积极解决和处理当中，后期在公司运营管理上将作全面化的改进，减少法律风险。

// 十、结论及工作措施建议
// 借款人为四川省煤田地质局直属大型国有施工企业，资产规模较大、行业排名靠前，经过二十多年的经营发展，已经成为行业中具有相当实力的企业。从当下及未来趋势，该企业都是众多金融机构争相合作的优质客户。该企业抗风险能力强，对于债权人来讲，具有较强的短期、长期负债还款能力，且深入合作潜力较大，同时做好以下工作：
// 1、目前该企业现行管理机制严密，技术经营体系健全，运行良好，有效地控制了管理风险。2019年2月25日，四川省煤田地质局因干部年轻化，借款人高层发生变化，新任原135队队长柯军为借款人董事长，原借款人党委书记张海铭为借款人总经理。地质局根据对借款人管理层的实际管理经验、工作能力、专业技术都提出了更高的要求，这对借款人的经营发展是相当有利的。本次贷后收集了借款人和担保人最新的营业执照和法定代表人身份证，并在系统中作了变更。
// 2、随时进行定期与不定期地贷后管理核查，密切关注他行金融机构授信变化情况。
// 3、密切监控我行信贷资金的流向，确保信贷资金用于采购材料和日常流动资金，做到专款专用；随时关注与下游结算情况；
// 4、借款人目前经营发展放缓，跟前期外部和内部的审查有关，据借款人高管介绍，目前公司正在实施的PPP项目较多，实施期限相比传统业务工期较长，项目金额较大，短时间内公司的经营收入不会受太大影响，在此次外部审查后，将重新大力发展新增业务。对此我们将做好贷后检查工作，关注借款人后期的经营发展状况；
// 5、公司历史遗留问题及内部的控制和机制的优化，根据对借款人的管理层的背景了解，都是具有相当管理层次及资历的年轻结构化人才，对企业自身的发展和改革能起到较良性的积极作用。
// 6、据调查，我部于2019年8月7日得知，借款人股东四川省煤田地质局已获得四川省农行17.89亿授信，其中流动资金授信额为10亿，项目贷款授信为7.89亿，这对四川省煤田地质局和借款人来说，较低成本的资金将有助于整个集团的经营发展。本次贷后发现，原授信银行兴业银行和广发银行暂时退出，为补足借款人流动资金需求，四川省煤田地质局提用了农行的流动资金贷款3亿，以往来款的形式借给借款人，成本为农行贷款利率成本5.8%，降低了借款人的财务成本。

// 主客户经理（签字）：            日期：      
// 从客户经理（签字）：            日期：     
// 机构负责人（签字）：            日期：

// 贷后管理报告附件清单（包括但不限于以下资料）：
// 1.更新后的基础情况资料(如有)。根据信贷客户及保证人基本情况的变化，及时收集变更后的营业执照、身份证等相关证照、证件类资料，并在相关系统中作变更处理。
// 2.账户资金监测表（按本办法所附的固定格式模板填写）   
// 3.按月（季）收集的财务报表资料
// 4.《提示归还到期贷款通知书》（如有）
// 5.《提示归还到期贷款（按计划还款）通知书》（如有）
// 6.《催收逾期（不良）贷款本息通知书》（如有）
// 7.借款人征信报告
// 8.还款凭证（如有）
// 9.能证明借款人经营情况、项目进度变化的资料
// 10.其他用于证明贷后检查报告阐述内容的资料。

// `


// const checkDifference = (textModel, text2) => {
//     let textModelArray = textModel.replace(/ /g, "").replace(/\t/g, "").split("\n")
//     let text2Array = text2.replace(/ /g, "").replace(/\t/g, "").split("\n")
//     let similarity = []
//     textModelArray.forEach(ele1 => {
//         text2Array.forEach(ele2 => {
//             if (ele1 === ele2){
//                 similarity.push(ele1)
//             }
//         })
//     });

//     let similarityWithOutNothing = []
//     similarity.forEach(e => {
//         if(e !== ""){
//             similarityWithOutNothing.push(e)
//         }
//     })

//     // console.log("附件3" === "附件3")
//     // console.log(similarityWithOutNothing)
//     // console.log(textModelArray)
//     let sameIndexToModel = []
//     // let differenceTotext2 = []
//     similarityWithOutNothing.forEach(e => {
//         sameIndexToModel.push(textModelArray.findIndex(ele => {
//             return ele === e
//         }))
//     })
//     console.log(sameIndexToModel)
//     // return similarity
// }

// checkDifference(txt1, txt2)

console.log(Boolean([1, 2, 3].findIndex(e => {
    return e === 4
})))